
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СтатусыАбонементов.Записывать = Истина;
	Движения.ОстаткиПосещений.Записывать = Истина;
	
	Запись = Движения.СтатусыАбонементов.Добавить();
	Запись.Абонемент = Ссылка;
	Запись.Период = НачалоДня(Дата);
	Запись.Статус = Перечисления.СтатусыАбонементов.НеАктивирован;
	
	Если ВидАбонемента.КоличествоЗанятий Тогда
		
		Запись = Движения.ОстаткиПосещений.ДобавитьПриход();
		Запись.Период = Дата;
		Запись.Абонемент = Ссылка;
		Запись.Количество = ВидАбонемента.КоличествоЗанятий;
		
	КонецЕсли;

КонецПроцедуры
