
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФиксацияПосещенийПосещения.Абонемент
	|ИЗ
	|	Документ.ФиксацияПосещений.Посещения КАК ФиксацияПосещенийПосещения
	|ГДЕ
	|	ФиксацияПосещенийПосещения.Ссылка = &Ссылка
	|	И ФиксацияПосещенийПосещения.Абонемент.ВидАбонемента.КоличествоЗанятий > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = Движения.ОстаткиПосещений.ДобавитьРасход();
		Запись.Абонемент = Выборка.Абонемент;
		Запись.Количество = 1;
		
	КонецЦикла;
	
	Движения.ОстаткиПосещений.Записать();
	
	Запрос = Новый Запрос;

КонецПроцедуры
